# 01 자료형
# 숫자형
print("""숫자형의 계산은
1. 사칙연산의 순서를을 따른다.
2. 정수형과 정수형의 연산 결과값은 '정수형'이다.
3. 정수형과 소수형, 소수형과 소수형의 연산 결과값은 '소수형'이다.
4. 나눗셈 연산의 결과값은 '소수형'이다.""")
print()

# 덧셈 연산
print(4 + 7)
print()

# 뺄셈 연산
print(2 - 4)
print(2.0 - 4.0)
print(2 - 4.0)
print()

# 곱셈 연산
print(5 * 3)
print(5.0 * 3.0)
print(5 * 3.0)
print()

# 나머지 연산
print(7 % 3)  # 1
print(7.0 % 3.0)
print(7 % 3.0)
print()

# 거듭제곱 연산
print(2 ** 3)  # 8
print(2.0 ** 3.0)
print(2 ** 3.0)
print()

# 나눗셈 연산
print(7 / 2)  # 3.5
print(6 / 2)  # 3.0
print(7.0 / 2)
print(6.0 / 2.0)
print()

# 파이썬의 계산은 사칙연산을 따른다.
print(2 + 3 * 2)
print(2 * (2 + 3))
