# print 함수와 문자열 실습

# '응답하라 1988'은 많은 시청자들에게 사랑을 받은 드라마예요.
# 데카르트는 "나는 생각한다. 고로 존재한다."라고 말했다.
# print("""---""")
print("""'응답하라 1988'은 많은 시청자들에게 사랑을 받은 드라마예요.
데카르트는 "나는 생각한다. 고로 존재한다."라고 말했다.""")
# print("--'=='....") & print('--"=="...')
print("'응답하라 1988'은 많은 시청자들에게 사랑을 받은 드라마예요.")
print('데카르트는 "나는 생각한다. 고로 존재한다."라고 말했다.')
# print('--\'==\'...') & print("--\"==\"...")
print('\'응답하라 1988\'은 많은 시청자들에게 사랑을 받은 드라마예요.')
print("데카르트는 \"나는 생각한다. 고로 존재한다.\"라고 말했다.")
# use \n
print('\'응답하라 1988\'은 많은 시청자들에게 사랑을 받은 드라마예요.' + "\n데카르트는 \"나는 생각한다. 고로 존재한다.\"라고 말했다.")

# 영화 '신세계'에서 "드루와~"라는 대사가 유행했다.
print("영화 '신세계'에서 \"드루와~\"라는 대사가 유행했다.")
